app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.article_id = params[:article_id]

    @comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "Mr Bobby McGee"], ["body", "How you all doing out there?"], ["article_id", 1], ["created_at", "2017-11-10 08:42:15.253475"], ["updated_at", "2017-11-10 08:42:15.253475"]]